<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"80a46b58265c36051b8746851cafba4880319a547b703be00f8328853bb12e9b","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #941 at https://github.com/cal-itp/data-infra/actions/runs/19154628977","plan_out_hash":"716258caae992892ce276a8bc6b579f886c5d885fa854ff42c1aa3cadc282ba4","plan_hash":"b77ab1c8f444efb18730206fde248e986f57a17de05fd9e9d847e9d42cc45642","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/hooks/ckan_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "Ny8SnQ==" -> (known after apply)
!~      detect_md5hash      = "z2cK/dimE4LMmKtT2S/gpQ==" -> "different hash"
!~      generation          = 1762463102715082 -> (known after apply)
        id                  = "calitp-composer-plugins/hooks/ckan_hook.py"
!~      md5hash             = "z2cK/dimE4LMmKtT2S/gpQ==" -> (known after apply)
        name                = "plugins/hooks/ckan_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "wl6llg==" -> (known after apply)
!~      detect_md5hash      = "HF+Xx6KjvceJ7rl0YQjZKA==" -> "different hash"
!~      generation          = 1762463102714120 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "HF+Xx6KjvceJ7rl0YQjZKA==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #941](https://github.com/cal-itp/data-infra/actions/runs/19154628977)